package EffectiveJava3rd.hMethods;

//56 为所有已公开的API元素编写文档注释
public class H56 {
    //要正确地记录API，必须在每个导出的类、接口、构造方法、方法和属性声明之前加上文档注释。
    //文档注释在源代码和生成的文档中都应该是可读的通用原则。
    //类或接口中 的两个成员或构造方法不应具有相同的概要描述。
    //记录泛型类型或方法时，请务必记录所有类型参数。
    //在记录枚举类型时，一定要记录常量，以及类型和任何公共方法。
    //在为注解类型记录文档时，一定要记录任何成员，以及类型本身。
    //无论类或静态方法是否线程安全，都应该在文档中描述其线程安全级别。如果一个类是可序列化的，应该记录它的序列化形式。
    //要正确地记录API，必须在每个导出的类、接口、构造方法、方法和属性声明之前加上文档注释。
    //文档注释在源代码和生成的文档中都应该是可读的通用原则。
    //类或接口中的两个成员或构造方法不应具有相同的概要描述。

    //文档注释是记录API的最佳、最有效的方法。
}
